package com.horstmann.ch4.ex7;

/**
 * Определите перечислимый тип для восьми комбинаций основных цветов —
 * BLACK, RED, BLUE, GREEN, CYAN, MAGENTA, YELLOW, WHITE — с методами getRed(), getGreen() и getBlue().
 */
public class Main {

    public static void main(String[] args) {
        System.out.println(Colors.getRed());
        System.out.println(Colors.getGreen());
        System.out.println(Colors.getBlue());
    }
}
